## Terraform Plan - `k8s-cluster` - Development 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourcegroups/feyrek8s-dev-rg/providers/Microsoft.ContainerService/managedClusters/feyrek8s-dev-aks]
azurerm_role_assignment.acrpull_role: Refreshing state... [id=/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourceGroups/feyrek8s-dev-rg/providers/Microsoft.ContainerRegistry/registries/feyrek8sacrdev/providers/Microsoft.Authorization/roleAssignments/12a4320d-cf1d-f021-d906-dd99bd6ff7f9]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_kubernetes_cluster.default has been changed
  ~ resource "azurerm_kubernetes_cluster" "default" {
      + api_server_authorized_ip_ranges = []
        id                              = "/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourcegroups/feyrek8s-dev-rg/providers/Microsoft.ContainerService/managedClusters/feyrek8s-dev-aks"
        name                            = "feyrek8s-dev-aks"
        tags                            = {
            "created_by" = "Terraform"
        }
        # (13 unchanged attributes hidden)


      ~ default_node_pool {
          + availability_zones           = []
            name                         = "default"
          + node_labels                  = {}
          + node_taints                  = []
          + tags                         = {}
            # (15 unchanged attributes hidden)
        }



        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
      + automatic_channel_upgrade       = ""
      + disk_encryption_set_id          = ""
      + dns_prefix_private_cluster      = ""
        id                              = "/subscriptions/2a951275-83dd-49a2-abd2-195c4345cce1/resourcegroups/feyrek8s-dev-rg/providers/Microsoft.ContainerService/managedClusters/feyrek8s-dev-aks"
      + kube_admin_config_raw           = (sensitive value)
        name                            = "feyrek8s-dev-aks"
      + private_dns_zone_id             = ""
      + private_fqdn                    = ""
        tags                            = {
            "created_by" = "Terraform"
        }
        # (14 unchanged attributes hidden)





      ~ service_principal {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ client_id     = (sensitive)
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ client_secret = (sensitive value)
        }
        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s-cluster`, Workflow: `deployment`

## Terraform Plan - `k8s` - Development 🪐
- Terraform Format and Style 🖌: `success`
- Terraform Initialization ⚙️: `success`
- Terraform Validation 🤖: `success`
- Terraform Plan 📖: `success`

<details><summary><b>Show Plan</b></summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.backend.kubectl_manifest.backend_deployment[0] will be created
  + resource "kubectl_manifest" "backend_deployment" {
      + api_version             = "apps/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = "backend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              replicas: 2
              selector:
                matchLabels:
                  name: backend
              template:
                metadata:
                  labels:
                    name: backend
                spec:
                  containers:
                  - args:
                    - app.py
                    command:
                    - python3
                    image: birkik8sacr.azurecr.io/backend:dev
                    imagePullPolicy: Always
                    name: backend
                    ports:
                    - containerPort: 80
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.backend.kubectl_manifest.backend_namespace[0] will be created
  + resource "kubectl_manifest" "backend_namespace" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: backend
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.backend.kubectl_manifest.backend_service[0] will be created
  + resource "kubectl_manifest" "backend_service" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "backend"
      + namespace               = "backend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                name: backend
              name: backend
              namespace: backend
            spec:
              ports:
              - port: 80
                targetPort: 80
              selector:
                name: backend
              type: ClusterIP
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_deployment[0] will be created
  + resource "kubectl_manifest" "frontend_deployment" {
      + api_version             = "apps/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "frontend"
      + namespace               = "frontend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                name: frontend
              name: frontend
              namespace: frontend
            spec:
              replicas: 1
              selector:
                matchLabels:
                  name: frontend
              template:
                metadata:
                  labels:
                    name: frontend
                spec:
                  containers:
                  - args:
                    - app.js
                    command:
                    - node
                    env:
                    - name: DISCORD_TOKEN
                      valueFrom:
                        secretKeyRef:
                          key: DISCORD_TOKEN
                          name: frontend-secret
                    - name: ENVIRONMENT
                      value: dev
                    image: birkik8sacr.azurecr.io/frontend:dev
                    imagePullPolicy: Always
                    name: frontend
                    resources:
                      limits:
                        cpu: "0.5"
                        memory: 500Mi
                      requests:
                        cpu: "0.25"
                        memory: 50Mi
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_namespace[0] will be created
  + resource "kubectl_manifest" "frontend_namespace" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "frontend"
      + namespace               = (known after apply)
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: frontend
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.frontend.kubectl_manifest.frontend_secret[0] will be created
  + resource "kubectl_manifest" "frontend_secret" {
      + api_version             = "v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "frontend-secret"
      + namespace               = "frontend"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: frontend-secret
              namespace: frontend
            type: Opaque
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

> Pusher: @GrantBirki, Action: `pull_request`, Working Directory: `terraform/k8s`, Workflow: `deployment`